Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff

      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-cpu-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-cpu-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 75
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.memory_utilization will be created
+ resource "aws_cloudwatch_metric_alarm" "memory_utilization" {
      + actions_enabled                       = true
      + alarm_description                     = "Redis memory utilization is too high"
      + alarm_name                            = "crawlinghub-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-memory-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-memory-alarm"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # aws_elasticache_cluster.main will be created
+ resource "aws_elasticache_cluster" "main" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "crawlinghub-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "sun:05:00-sun:07:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.small"
      + num_cache_nodes            = 1
      + parameter_group_name       = "crawlinghub-redis-prod"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 7
      + snapshot_window            = "03:00-05:00"
      + subnet_group_name          = "crawlinghub-redis-prod"
      + tags                       = {
          + "Component"   = "elasticache-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                   = {
          + "Component"   = "elasticache-cluster"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + transit_encryption_enabled = (known after apply)

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

  # aws_elasticache_parameter_group.main will be created
+ resource "aws_elasticache_parameter_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-prod"
      + tags        = {
          + "Component"   = "parameter-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all    = {
          + "Component"   = "parameter-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
      + parameter {
          + name  = "timeout"
          + value = "300"
        }
    }

  # aws_elasticache_subnet_group.main will be created
+ resource "aws_elasticache_subnet_group" "main" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-prod"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "Component"   = "elasticache-subnet-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all    = {
          + "Component"   = "elasticache-subnet-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for crawlinghub-redis-prod"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Redis from VPC"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "crawlinghub-redis-prod-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all               = {
          + "Component"   = "security-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "crawlinghub-redis-prod-sg"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Redis endpoint for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/redis/endpoint"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-endpoint"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-endpoint"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Redis port for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/redis/port"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-port"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "Name"        = "ssm-crawlinghub-redis-prod-port"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_id           = (known after apply)
+ endpoint             = (known after apply)
+ engine_log_group     = "/aws/elasticache/crawlinghub-redis-prod/engine-log"
+ parameter_group_name = "crawlinghub-redis-prod"
+ port                 = 6379
+ security_group_id    = (known after apply)
+ slow_log_group       = "/aws/elasticache/crawlinghub-redis-prod/slow-log"
+ subnet_group_name    = "crawlinghub-redis-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/elasticache-redis
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Felasticache-redis%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/elasticache-redis
  ```
Plan: 10 to add, 0 to change, 0 to destroy.

---
### 4. dir: `terraform/github-oidc` workspace: `default`
```diff
aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::646886795421:oidc-provider/token.actions.githubusercontent.com]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.github_actions: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_iam_role.github_actions: Read complete after 1s [id=crawlinghub-prod-github-actions-role]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/github-oidc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fgithub-oidc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/github-oidc
  ```

---
### 5. dir: `terraform/sqs-queue` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.dlq_messages will be created
+ resource "aws_cloudwatch_metric_alarm" "dlq_messages" {
      + actions_enabled                       = true
      + alarm_description                     = "Messages in DLQ detected"
      + alarm_name                            = "crawlinghub-schedule-trigger-prod.fifo-dlq-messages"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "crawlinghub-schedule-trigger-prod-dlq.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo-dlq-alarm"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo-dlq-alarm"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.queue_depth will be created
+ resource "aws_cloudwatch_metric_alarm" "queue_depth" {
      + actions_enabled                       = true
      + alarm_description                     = "SQS queue depth is too high"
      + alarm_name                            = "crawlinghub-schedule-trigger-prod.fifo-depth"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "crawlinghub-schedule-trigger-prod.fifo"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo-depth-alarm"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all                              = {
          + "Component"   = "cloudwatch-alarm"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo-depth-alarm"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_sqs_queue.schedule_trigger will be created
+ resource "aws_sqs_queue" "schedule_trigger" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "crawlinghub-schedule-trigger-prod.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Component"   = "sqs-fifo"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Purpose"     = "schedule-trigger"
          + "Service"     = "crawlinghub"
        }
      + tags_all                          = {
          + "Component"   = "sqs-fifo"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod.fifo"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Purpose"     = "schedule-trigger"
          + "Service"     = "crawlinghub"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.schedule_trigger_dlq will be created
+ resource "aws_sqs_queue" "schedule_trigger_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "crawlinghub-schedule-trigger-prod-dlq.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Component"   = "sqs-fifo-dlq"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod-dlq.fifo"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Purpose"     = "schedule-trigger-dlq"
          + "Service"     = "crawlinghub"
        }
      + tags_all                          = {
          + "Component"   = "sqs-fifo-dlq"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-schedule-trigger-prod-dlq.fifo"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Purpose"     = "schedule-trigger-dlq"
          + "Service"     = "crawlinghub"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.schedule_trigger will be created
+ resource "aws_sqs_queue_policy" "schedule_trigger" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_ssm_parameter.queue_arn will be created
+ resource "aws_ssm_parameter" "queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SQS schedule trigger queue ARN for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/sqs/schedule-trigger-queue-arn"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-crawlinghub-schedule-trigger-prod.fifo-arn"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-crawlinghub-schedule-trigger-prod.fifo-arn"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.queue_url will be created
+ resource "aws_ssm_parameter" "queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "SQS schedule trigger queue URL for crawlinghub"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/prod/sqs/schedule-trigger-queue-url"
      + tags           = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-crawlinghub-schedule-trigger-prod.fifo-url"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tags_all       = {
          + "Component"   = "parameter-store"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ssm-crawlinghub-schedule-trigger-prod.fifo-url"
          + "Owner"       = "windsurf@ryuqqq.com"
          + "Service"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ dlq_arn    = (known after apply)
+ dlq_name   = "crawlinghub-schedule-trigger-prod-dlq.fifo"
+ dlq_url    = (known after apply)
+ queue_arn  = (known after apply)
+ queue_name = "crawlinghub-schedule-trigger-prod.fifo"
+ queue_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/sqs-queue
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fsqs-queue%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/sqs-queue
  ```
Plan: 7 to add, 0 to change, 0 to destroy.

---
### Plan Summary

5 projects, 4 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```